Configure/VOF_Model/0/U_flowrate
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
#include	"flowCondition"

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform $velocity;

boundaryField
{
    Ceiling
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    Inlet_water
    {
        type            flowRateInletVelocity;
		volumetricFlowRate $flowrate;
        value           uniform (0 0 0);
    }
    Inlet_air
    {
        type fixedValue;
        value           uniform (0 0 0);
    }
    Outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    ".*"
    {
        type            noSlip;
    }

}
