Configure/VOF_Model/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    Inlet_air
    {
        type 			fixedValue;
        value           uniform 0; 
    }
    Inlet_water
    {
        type 			fixedValue;
        value           uniform 1; 
    }
    Ceiling
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

	".*"
	{
        type            zeroGradient;
	}
}


// ************************************************************************* //
