Configure/VOF_Model/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include	"flowCondition"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $k;

boundaryField
{
    Inlet_air
    {
        type            fixedValue;
        intensity       0.05;
        value           $internalField;
    }
    Inlet_water
    {
        type            fixedValue;
        intensity       0.05;
        value           $internalField;
    }
    Outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ".*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    Ceiling
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
