Configure/VOF_Model/system/blockMeshDict_temp
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// these variables are set from the python scripts
NumX %NumX%;
NumY %NumY%;
NumZ1 %NumZ1%;
NumZ2 %NumZ2%;
MinX %Xmin%;
MaxX %Xmax%;
MinY %Ymin%;
MaxY %Ymax%;
MinZ %Zmin%;
WSE  %WSE%;
MaxZ %Zmax%;

vertices
(
    ( $MinX $MinY $MinZ )
    ( $MaxX $MinY $MinZ )
    ( $MaxX $MaxY $MinZ )
    ( $MinX $MaxY $MinZ )
	
    ( $MinX $MinY $WSE )
    ( $MaxX $MinY $WSE )
    ( $MaxX $MaxY $WSE )
    ( $MinX $MaxY $WSE )
	
    ( $MinX $MinY $MaxZ )
    ( $MaxX $MinY $MaxZ )
    ( $MaxX $MaxY $MaxZ )
    ( $MinX $MaxY $MaxZ )
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 ) ( $NumX $NumY $NumZ1 ) simpleGrading ( 1 1 1 )
	hex ( 4 5 6 7 8 9 10 11 ) ( $NumX $NumY $NumZ2 ) simpleGrading ( 1 1 1 )
);

edges
(
);

boundary
(
    Inlet_water
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    Inlet_air
    {
        type patch;
        faces
        (
            (4 8 11 7)
        );
    }	
    Outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
			(6 10 9 5)
        );
    }
    RightWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
			(5 9 8 4)
        );
    }
    LeftWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
			(7 11 10 6)
        );
    }
    Floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    Ceiling
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
);

// ************************************************************************* //
